## Corey Solitaire
## 8/13
## Dataframes Lesson

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
from pydataset import data

   ## 1. Copy the code from the lesson to create a dataframe full of student                  grades.

In [4]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

student_grades = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(student_grades)

pandas.core.frame.DataFrame

In [5]:
# a. Create a column named passing_english that indicates whether each student has a passing grade in reading.
student_grades['passing_english'] = student_grades.english > 70
student_grades

# I crated a new column in my data frame by using the indexing operator to name my column
# I then set that name as a variable (=) to a series of boolean values using the 'english' series (.english)
# Where True represents grades greater then 70 and False represents grades less than 70

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72            False

In [6]:
# b. Sort the english grades by the passing_english column. How are duplicates handled?
        
passing_english = student_grades.sort_values(by = 'passing_english')
passing_english

# The sort returns boolean values, so there are no duplicates
# To sort the grades i used the .sort_values(by) method
# This method sorts alphabetically so False values(students failing english) were displayed first

       name  math  english  reading  passing_english
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
11     Alan    92       62       72            False
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
9   Richard    69       80       94             True
10    Isaac    92       99       93             True

In [7]:
# c. Sort the english grades first by passing_english and then by student name. All the students that are 
#    failing english should be first, and within the students that are failing english they should be ordered 
#    alphabetically. The same should be true for the students passing english. (Hint: you can pass a list to 
#    the .sort_values method)


sorted_grades = student_grades.sort_values(by = 'passing_english').groupby(['passing_english']).apply(lambda x: x.sort_values([
    'name'
]))
sorted_grades

# To sort the grades i used the .sort_values(by) method
# This method sorts alphabetically so False values(students failing english) were displayed first
# On top of the first .sort_values I also had too add a .groupby
# A groupby operation involves some combination of splitting the object, applying a function, and 
#  combining the results. 
# The lambda function takes the sorted and grouped data and then organizes it alphabetically by name 
# using another .sort_values

                       name  math  english  reading  passing_english
passing_english
False           11     Alan    92       62       72            False
                8    Albert    92       62       87            False
                7     Marie    93       63       90            False
                6    Thomas    82       64       81            False
True            4       Ada    77       92       98             True
                3     Billy    98       96       88             True
                10    Isaac    92       99       93             True
                1      Jane    88       79       67             True
                5      John    79       76       93             True
                9   Richard    69       80       94             True
                0     Sally    62       85       80             True
                2     Suzie    94       74       95             True

In [8]:
# d. Sort the english grades first by passing_english, and then by the actual english grade, similar to 
#    how we did in the last step.
             
    
more_sorted_grades = student_grades.sort_values(by = 'passing_english').groupby(['passing_english']).apply(lambda x: x.sort_values([
    'english'
]))
more_sorted_grades

# To sort the grades i used the .sort_values(by) method
# This method sorts alphabetically so False values(students failing english) were displayed first
# On top of the first .sort_values I also had too add a .groupby
# A groupby operation involves some combination of splitting the object, applying a function, and 
#  combining the results. 
# The lambda function takes the sorted and grouped data and then organizes it by english grade ascencing
# using another .sort_values

                       name  math  english  reading  passing_english
passing_english
False           8    Albert    92       62       87            False
                11     Alan    92       62       72            False
                7     Marie    93       63       90            False
                6    Thomas    82       64       81            False
True            2     Suzie    94       74       95             True
                5      John    79       76       93             True
                1      Jane    88       79       67             True
                9   Richard    69       80       94             True
                0     Sally    62       85       80             True
                4       Ada    77       92       98             True
                3     Billy    98       96       88             True
                10    Isaac    92       99       93             True

In [16]:
# e. Calculate each students overall grade and add it as a column on the dataframe. The overall grade is 
#    the average of the math, english, and reading grades.

overall_grade = (student_grades.math + student_grades.english + student_grades.reading) / 3
#overall_grade


student_grades['overall_grade'] = overall_grade
student_grades

# To calculate the overall grade I used the vectorized operations availible in Pandas:
# 1. First I added together the students individual grades in math, english, and reading
# 2. Then I devided that total by the 3, the total number of observations to obtain the average(overall grade)
# #. Once I had a dataframe of overall_grades i added it as a colum to my student_grades data frame

       name  math  english  reading  passing_english  overall_grade
0     Sally    62       85       80             True      75.666667
1      Jane    88       79       67             True      78.000000
2     Suzie    94       74       95             True      87.666667
3     Billy    98       96       88             True      94.000000
4       Ada    77       92       98             True      89.000000
5      John    79       76       93             True      82.666667
6    Thomas    82       64       81            False      75.666667
7     Marie    93       63       90            False      82.000000
8    Albert    92       62       87            False      80.333333
9   Richard    69       80       94             True      81.000000
10    Isaac    92       99       93             True      94.666667
11     Alan    92       62       72            False      75.333333

## 2.Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:

In [ ]:
mpg_df = data('mpg')
mpg_df.info()

In [ ]:
# a. How many rows and columns are there?
mpg_df.shape
# Tuple (Rows/Columns)

In [ ]:
mpg_df.info

In [ ]:
# b. What are the data types of each column?
mpg_df.dtypes

In [ ]:
# c. Summarize the dataframe with .info and .describe
mpg_df.info

In [ ]:
mpg_df.describe

In [ ]:
# d. Rename the cty column to city.
mpg_df.rename(columns = {'cty':'city'}, inplace = True)
mpg_df

In [ ]:
# e. Rename the hwy column to highway.
mpg_df.rename(columns = {'hwy':'highway'}, inplace = True)
mpg_df

In [ ]:
# f. Do any cars have better city mileage than highway mileage?

#This gives the answer but I want to dig deeper
#mpg_df.sort_values(by = 'city', ascending = False)
# pd.set_option("display.max_rows", None)
# city_or_highway = mpg_df.sort_values(by = 'city').groupby(['city']).apply(lambda x: x.sort_values(['highway']))  
# city_or_highway

better_city = (mpg_df.city) >= (mpg_df.highway)
better_city.value_counts()

In [ ]:
# g. Create a column named mileage_difference this column should contain the difference between highway 
#    and city mileage for each car.

mpg_df['mileage_difference'] = (mpg_df.highway)-(mpg_df.city)
mpg_df

In [ ]:
# h. Which car (or cars) has the highest mileage difference?

mpg_df.sort_values(by = 'mileage_difference', ascending =False).nlargest(n=1, columns='mileage_difference',  keep='all')

In [ ]:
# i. Which compact class car has the lowest highway mileage? The best?

compact_cars = mpg_df['class'] == 'compact'
mpg_df[compact_cars].sort_values(by = 'mileage_difference').nsmallest(n=1, columns='mileage_difference',  keep='all')



#.groupby(['passing_english'])

In [ ]:
# Which compact class car has the best highway mileage?
mpg_df[compact_cars].sort_values(by = 'mileage_difference').nlargest(n=1, columns='mileage_difference',  keep='all')

In [ ]:
# j. Create a column named average_mileage that is the mean of the city and highway mileage.

average_mileage = (mpg_df.city + mpg_df.highway) / 2
mpg_df['average_mileage'] = average_mileage
mpg_df

In [ ]:
# k. Which dodge car has the best average mileage?
dodge = mpg_df['manufacturer'] == 'dodge'
mpg_df[dodge].sort_values(by = 'average_mileage').nlargest(n=1, columns='average_mileage',  keep='all')

In [ ]:
# Which dodge car has the worst average mileage?

mpg_df[dodge].sort_values(by = 'average_mileage').nsmallest(n=1, columns='average_mileage',  keep='all')

## 3. Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

In [4]:
mammals_df = data('Mammals')
mammals_df.info()
data

<class 'pandas.core.frame.DataFrame'>
Int64Index: 107 entries, 1 to 107
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   weight    107 non-null    float64
 1   speed     107 non-null    float64
 2   hoppers   107 non-null    bool
 3   specials  107 non-null    bool
dtypes: bool(2), float64(2)
memory usage: 2.7 KB

In [5]:
# a. How many rows and columns are there?

mammals_df.shape

#(62 Rows, 2 Columns)

(107, 4)

In [6]:
# b. What are the data types?

mammals_df.dtypes

weight      float64
speed       float64
hoppers        bool
specials       bool
dtype: object

In [7]:
# c. Summarize the dataframe with .info and .describe

mammals_df.info

<bound method DataFrame.info of        weight  speed  hoppers  specials
1    6000.000   35.0    False     False
2    4000.000   26.0    False     False
3    3000.000   25.0    False     False
4    1400.000   45.0    False     False
5     400.000   70.0    False     False
6     350.000   70.0    False     False
7     300.000   64.0    False     False
8     260.000   70.0    False     False
9     250.000   40.0    False     False
10   3800.000   25.0    False      True
11   1000.000   60.0    False     False
12    900.000   70.0    False     False
13    900.000   56.0    False     False
14    800.000   29.0    False     False
15    750.000   57.0    False     False
16    500.000   32.0    False     False
17    450.000   56.0    False     False
18    300.000   72.0    False     False
19    300.000   90.0    False     False
20    250.000   80.0    False     False
21    250.000   56.0    False     False
22    170.000   80.0    False     False
23    150.000   48.0    False     False
24    130.000   70.0    False     False
25    120.000   80.0    False     False
26    120.000   61.0    False     False
27    110.000   33.0    False     False
28    100.000   64.0    False     False
29     85.000   55.0    False     False
30     80.000   65.0    False     False
31     72.000   56.0    False     False
32     70.000   45.0    False     False
33     65.000   60.0    False     False
34     62.000   81.0    False     False
35     50.000  100.0    False     False
36     50.000   60.0    False     False
37     50.000   40.0    False     False
38     50.000   47.0    False     False
39     37.000  105.0    False     False
40     35.000   80.0    False     False
41     34.000   97.0    False     False
42     30.000   97.0    False     False
43     30.000   80.0    False     False
44     30.000   45.0    False     False
45     20.000   81.0    False     False
46    400.000   40.0    False     False
47    300.000   48.0    False     False
48    230.000   56.0    False     False
49    150.000   59.0    False     False
50    135.000   48.0    False     False
51     65.000   65.0    False     False
52     60.000   60.0    False     False
53     55.000  110.0    False     False
54     45.000   50.0    False     False
55     40.000   64.0    False     False
56     25.000   67.0    False     False
57     20.000   70.0    False     False
58     16.000   65.0    False     False
59     12.000   24.0    False      True
60     11.000   30.0    False      True
61     10.000   56.0    False     False
62      7.000   60.0    False     False
63      6.000   72.0    False     False
64      5.000   64.0    False     False
65      5.000   27.0    False      True
66      3.000   16.0    False      True
67    127.000   32.0    False     False
68     70.000   40.0    False      True
69     13.000   37.0    False      True
70      9.000    3.2    False      True
71      4.000   16.0    False     False
72      0.600   36.0    False     False
73      0.600   20.0    False     False
74      0.550   27.0    False     False
75      0.500   18.0    False     False
76      0.400   20.0    False     False
77      0.300   13.0    False     False
78      0.250    9.7    False     False
79      0.220   15.0    False     False
80      0.110    9.0    False     False
81      0.100   17.0    False     False
82      0.056   21.0     True     False
83      0.050   11.0    False     False
84      0.045   16.0    False     False
85      0.035   32.0     True     False
86      0.035   14.0     True     False
87      0.030    6.8    False     False
88      0.030    9.1    False     False
89      0.025   11.0    False     False
90      0.025    8.6    False     False
91      0.018    8.9    False     False
92      0.016   13.0    False     False
93      0.100    4.0    False     False
94      0.100    2.4    False     False
95      0.016    3.6    False     False
96      4.600   64.0     True     False
97      4.400   72.0     True     False
98      4.000   72.0     True     False
99      3.500   56.0     True     False
100     2.000   64.0     True     False
101     1.900   56.0     True     False
102     1.500   50.0     True     False
103     1.500   40.0     True     False
104    50.000   65.0    False     False
105     5.000    7.4    False      True
106     0.024   13.0    False     False
107     4.000    1.6    False      True>

In [8]:
mammals_df.describe

<bound method NDFrame.describe of        weight  speed  hoppers  specials
1    6000.000   35.0    False     False
2    4000.000   26.0    False     False
3    3000.000   25.0    False     False
4    1400.000   45.0    False     False
5     400.000   70.0    False     False
6     350.000   70.0    False     False
7     300.000   64.0    False     False
8     260.000   70.0    False     False
9     250.000   40.0    False     False
10   3800.000   25.0    False      True
11   1000.000   60.0    False     False
12    900.000   70.0    False     False
13    900.000   56.0    False     False
14    800.000   29.0    False     False
15    750.000   57.0    False     False
16    500.000   32.0    False     False
17    450.000   56.0    False     False
18    300.000   72.0    False     False
19    300.000   90.0    False     False
20    250.000   80.0    False     False
21    250.000   56.0    False     False
22    170.000   80.0    False     False
23    150.000   48.0    False     False
24    130.000   70.0    False     False
25    120.000   80.0    False     False
26    120.000   61.0    False     False
27    110.000   33.0    False     False
28    100.000   64.0    False     False
29     85.000   55.0    False     False
30     80.000   65.0    False     False
31     72.000   56.0    False     False
32     70.000   45.0    False     False
33     65.000   60.0    False     False
34     62.000   81.0    False     False
35     50.000  100.0    False     False
36     50.000   60.0    False     False
37     50.000   40.0    False     False
38     50.000   47.0    False     False
39     37.000  105.0    False     False
40     35.000   80.0    False     False
41     34.000   97.0    False     False
42     30.000   97.0    False     False
43     30.000   80.0    False     False
44     30.000   45.0    False     False
45     20.000   81.0    False     False
46    400.000   40.0    False     False
47    300.000   48.0    False     False
48    230.000   56.0    False     False
49    150.000   59.0    False     False
50    135.000   48.0    False     False
51     65.000   65.0    False     False
52     60.000   60.0    False     False
53     55.000  110.0    False     False
54     45.000   50.0    False     False
55     40.000   64.0    False     False
56     25.000   67.0    False     False
57     20.000   70.0    False     False
58     16.000   65.0    False     False
59     12.000   24.0    False      True
60     11.000   30.0    False      True
61     10.000   56.0    False     False
62      7.000   60.0    False     False
63      6.000   72.0    False     False
64      5.000   64.0    False     False
65      5.000   27.0    False      True
66      3.000   16.0    False      True
67    127.000   32.0    False     False
68     70.000   40.0    False      True
69     13.000   37.0    False      True
70      9.000    3.2    False      True
71      4.000   16.0    False     False
72      0.600   36.0    False     False
73      0.600   20.0    False     False
74      0.550   27.0    False     False
75      0.500   18.0    False     False
76      0.400   20.0    False     False
77      0.300   13.0    False     False
78      0.250    9.7    False     False
79      0.220   15.0    False     False
80      0.110    9.0    False     False
81      0.100   17.0    False     False
82      0.056   21.0     True     False
83      0.050   11.0    False     False
84      0.045   16.0    False     False
85      0.035   32.0     True     False
86      0.035   14.0     True     False
87      0.030    6.8    False     False
88      0.030    9.1    False     False
89      0.025   11.0    False     False
90      0.025    8.6    False     False
91      0.018    8.9    False     False
92      0.016   13.0    False     False
93      0.100    4.0    False     False
94      0.100    2.4    False     False
95      0.016    3.6    False     False
96      4.600   64.0     True     False
97      4.400   72.0     True     False
98      4.000   72.0     True     False
99      3.500   56.0     True     False
100     2.000   64.0     True     False
101     1.900   56.0     True     False
102     1.500   50.0     True     False
103     1.500   40.0     True     False
104    50.000   65.0    False     False
105     5.000    7.4    False      True
106     0.024   13.0    False     False
107     4.000    1.6    False      True>

In [18]:
# d. What is the the weight of the fastest animal?
fastest = mammals_df.sort_values(by = 'speed', ascending = False)
fastest_speed = mammals_df.speed == 110.0
mammals_df.weight[fastest_speed]

53    55.0
Name: weight, dtype: float64

In [25]:
# e. What is the overal percentage of specials?

mammals_df.specials.value_counts() / mammals_df.specials.shape

False    0.906542
True     0.093458
Name: specials, dtype: float64

In [37]:
# f. How many animals are hoppers that are above the median speed?

hoppers = mammals_df.hoppers == True
hopper_df = mammals_df[hoppers]
median_hopper_speed = hopper_df.speed.median()
hoppers_above_median = hopper_df.speed > median_hopper_speed
hoppers_above_median_df = hopper_df[hoppers_above_median]
hoppers_above_median_df

     weight  speed  hoppers  specials
96      4.6   64.0     True     False
97      4.4   72.0     True     False
98      4.0   72.0     True     False
100     2.0   64.0     True     False

In [51]:
# What percentage is this?

total_num_hoppers = hopper_df.shape

total_num_hoppers_above_median = hoppers_above_median_df.shape

total_percentage = total_num_hoppers_above_median[0] / total_num_hoppers[0]
total_percentage

0.36363636363636365